zephyrproject-rtos/zephyr/soc/microchip/pic32cxsg/pic32cxsg41/soc.h
#define TRNG              ((Trng     *)0x42002800UL) /**< \brief (TRNG) APB Base Address */
#define TRNG_INST_NUM     1                          /**< \brief (TRNG) Number of instances */
#define TRNG_INSTS        { TRNG }                   /**< \brief (TRNG) Instances List */

#define USB               ((Usb      *)0x41000000UL) /**< \brief (USB) APB Base Address */
#define USB_INST_NUM      1                          /**< \brief (USB) Number of instances */
#define USB_INSTS         { USB }                    /**< \brief (USB) Instances List */

#define WDT               ((Wdt      *)0x40002000UL) /**< \brief (WDT) APB Base Address */
#define WDT_INST_NUM      1                          /**< \brief (WDT) Number of instances */
#define WDT_INSTS         { WDT }                    /**< \brief (WDT) Instances List */

#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/*@}*/

#include "sercom_fixup_pic32cxsg.h"
#include "tc_fixup_pic32cxsg.h"
#include "gmac_fixup_pic32cxsg.h"
#include "adc_fixup_pic32cxsg.h"

/* #include "../common/soc_port.h" */
#include "../common/microchip_pic32cxsg_dt.h"

#include "../common/component/ac_component_fixup_pic32cxsg.h"
#include "../common/component/adc_component_fixup_pic32cxsg.h"
#include "../common/component/aes_component_fixup_pic32cxsg.h"
#include "../common/component/can_component_fixup_pic32cxsg.h"
#include "../common/component/ccl_component_fixup_pic32cxsg.h"
#include "../common/component/cmcc_component_fixup_pic32cxsg.h"
#include "../common/component/dac_component_fixup_pic32cxsg.h"
#include "../common/component/dmac_component_fixup_pic32cxsg.h"
#include "../common/component/dsu_component_fixup_pic32cxsg.h"
#include "../common/component/eic_component_fixup_pic32cxsg.h"
#include "../common/component/evsys_component_fixup_pic32cxsg.h"
#include "../common/component/freqm_component_fixup_pic32cxsg.h"
#include "../common/component/gclk_component_fixup_pic32cxsg.h"
#include "../common/component/gmac_component_fixup_pic32cxsg.h"
#include "../common/component/hmatrixb_component_fixup_pic32cxsg.h"
#include "../common/component/i2s_component_fixup_pic32cxsg.h"
#include "../common/component/icm_component_fixup_pic32cxsg.h"
#include "../common/component/mclk_component_fixup_pic32cxsg.h"
#include "../common/component/nvmctrl_component_fixup_pic32cxsg.h"
#include "../common/component/osc32kctrl_component_fixup_pic32cxsg.h"
#include "../common/component/oscctrl_component_fixup_pic32cxsg.h"
#include "../common/component/pac_component_fixup_pic32cxsg.h"
#include "../common/component/pcc_component_fixup_pic32cxsg.h"
#include "../common/component/pdec_component_fixup_pic32cxsg.h"
#include "../common/component/port_component_fixup_pic32cxsg.h"
#include "../common/component/qspi_component_fixup_pic32cxsg.h"
#include "../common/component/ramecc_component_fixup_pic32cxsg.h"
#include "../common/component/rstc_component_fixup_pic32cxsg.h"
#include "../common/component/rtc_component_fixup_pic32cxsg.h"
#include "../common/component/sdhc_component_fixup_pic32cxsg.h"
#include "../common/component/sercom_component_fixup_pic32cxsg.h"
#include "../common/component/supc_component_fixup_pic32cxsg.h"
#include "../common/component/tc_component_fixup_pic32cxsg.h"
#include "../common/component/tcc_component_fixup_pic32cxsg.h"
#include "../common/component/trng_component_fixup_pic32cxsg.h"
#include "../common/component/usb_component_fixup_pic32cxsg.h"
#include "../common/component/wdt_component_fixup_pic32cxsg.h"

#include "../common/instance/ac_instance_fixup_pic32cxsg.h"
#include "../common/instance/adc0_instance_fixup_pic32cxsg.h"
#include "../common/instance/adc1_instance_fixup_pic32cxsg.h"
#include "../common/instance/aes_instance_fixup_pic32cxsg.h"
#include "../common/instance/can0_instance_fixup_pic32cxsg.h"
#include "../common/instance/can1_instance_fixup_pic32cxsg.h"
#include "../common/instance/ccl_instance_fixup_pic32cxsg.h"
#include "../common/instance/cmcc_instance_fixup_pic32cxsg.h"
#include "../common/instance/dac_instance_fixup_pic32cxsg.h"
#include "../common/instance/dmac_instance_fixup_pic32cxsg.h"
#include "../common/instance/dsu_instance_fixup_pic32cxsg.h"
#include "../common/instance/eic_instance_fixup_pic32cxsg.h"
#include "../common/instance/evsys_instance_fixup_pic32cxsg.h"
#include "../common/instance/freqm_instance_fixup_pic32cxsg.h"
#include "../common/instance/gclk_instance_fixup_pic32cxsg.h"
#include "../common/instance/gmac_instance_fixup_pic32cxsg.h"
#include "../common/instance/hmatrix_instance_fixup_pic32cxsg.h"
#include "../common/instance/i2s_instance_fixup_pic32cxsg.h"
#include "../common/instance/icm_instance_fixup_pic32cxsg.h"
#include "../common/instance/mclk_instance_fixup_pic32cxsg.h"
#include "../common/instance/nvmctrl_instance_fixup_pic32cxsg.h"
#include "../common/instance/osc32kctrl_instance_fixup_pic32cxsg.h"
#include "../common/instance/oscctrl_instance_fixup_pic32cxsg.h"
#include "../common/instance/pac_instance_fixup_pic32cxsg.h"
#include "../common/instance/pcc_instance_fixup_pic32cxsg.h"
#include "../common/instance/pdec_instance_fixup_pic32cxsg.h"
#include "../common/instance/port_instance_fixup_pic32cxsg.h"
#include "../common/instance/qspi_instance_fixup_pic32cxsg.h"
#include "../common/instance/ramecc_instance_fixup_pic32cxsg.h"
#include "../common/instance/rstc_instance_fixup_pic32cxsg.h"
#include "../common/instance/rtc_instance_fixup_pic32cxsg.h"
#include "../common/instance/sdhc0_instance_fixup_pic32cxsg.h"
#include "../common/instance/sdhc1_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom0_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom1_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom2_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom3_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom4_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom5_instance_fixup_pic32cxsg.h"

#if   defined(__PIC32CX1025SG41100__) || defined(__PIC32CX1025SG41128__)
#include "../common/instance/sercom6_instance_fixup_pic32cxsg.h"
#include "../common/instance/sercom7_instance_fixup_pic32cxsg.h"
#endif

#include "../common/instance/supc_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc0_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc1_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc2_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc3_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc4_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc5_instance_fixup_pic32cxsg.h"

#if   defined(__PIC32CX1025SG41100__) || defined(__PIC32CX1025SG41128__)
#include "../common/instance/tc6_instance_fixup_pic32cxsg.h"
#include "../common/instance/tc7_instance_fixup_pic32cxsg.h"
#endif

#include "../common/instance/tcc0_instance_fixup_pic32cxsg.h"
#include "../common/instance/tcc1_instance_fixup_pic32cxsg.h"
#include "../common/instance/tcc2_instance_fixup_pic32cxsg.h"
#include "../common/instance/tcc3_instance_fixup_pic32cxsg.h"
#include "../common/instance/tcc4_instance_fixup_pic32cxsg.h"
#include "../common/instance/trng_instance_fixup_pic32cxsg.h"
#include "../common/instance/usb_instance_fixup_pic32cxsg.h"
#include "../common/instance/wdt_instance_fixup_pic32cxsg.h"

#define SOC_MICROCHIP_PIC32CXSG_OSC32K_FREQ_HZ 32768
#define SOC_MICROCHIP_PIC32CXSG_DFLL48_FREQ_HZ 48000000

/** Processor Clock (HCLK) Frequency */
#define SOC_MICROCHIP_PIC32CXSG_HCLK_FREQ_HZ 	CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC
/** Master Clock (MCK) Frequency */
#define SOC_MICROCHIP_PIC32CXSG_MCK_FREQ_HZ 	SOC_MICROCHIP_PIC32CXSG_HCLK_FREQ_HZ
#define SOC_MICROCHIP_PIC32CXSG_GCLK0_FREQ_HZ 	SOC_MICROCHIP_PIC32CXSG_MCK_FREQ_HZ
#define SOC_MICROCHIP_PIC32CXSG_GCLK2_FREQ_HZ 	48000000

#define SOC_ATMEL_SAM0_HCLK_FREQ_HZ 			CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC
#define SOC_ATMEL_SAM0_MCK_FREQ_HZ 				SOC_MICROCHIP_PIC32CXSG_HCLK_FREQ_HZ
#define SOC_ATMEL_SAM0_GCLK0_FREQ_HZ 			SOC_MICROCHIP_PIC32CXSG_MCK_FREQ_HZ
#define SOC_ATMEL_SAM0_GCLK2_FREQ_HZ 			48000000

#endif /* _SOC_MICROCHIP_PIC32CXSG41_SOC_H_ */
